## Question 1 - Display all movies titles.

## This query retrieves all movie titles available in the sakila database.
## Table used = "film"

In [ ]:
import pandas as pd
import mysql.connector

conn = mysql.connector.connect(
	host = 'localhost',
	user = 'root',
	password = '17wiknacAbc!',
	database = 'sakila'
)
query_1 = """
Select title from film;
"""
df_titles = pd.read_sql(query_1, conn)

df_titles.to_csv("../reports/Question1_movie_titles.csv", index = False)

In [4]:
df_titles.head(10)

              title
0  ACADEMY DINOSAUR
1    ACE GOLDFINGER
2  ADAPTATION HOLES
3  AFFAIR PREJUDICE
4       AFRICAN EGG
5      AGENT TRUMAN
6   AIRPLANE SIERRA
7   AIRPORT POLLOCK
8     ALABAMA DEVIL
9  ALADDIN CALENDAR

## Question 2 - Show list of unique video categories.

## This query retrieves all unique video categories available in the sakila database.
## Table used = "category"

In [ ]:
import pandas as pd
import mysql.connector

conn = mysql.connector.connect(
	host = 'localhost',
	user = 'root',
	password = '17wiknacAbc!',
	database = 'sakila'
)
query_2 = """
Select distinct name from category;
"""
df_category = pd.read_sql(query_2, conn)

df_category.to_csv("../reports/Question2_video_categories.csv", index = False)

In [7]:
df_category.head(10)

          name
0       Action
1    Animation
2     Children
3     Classics
4       Comedy
5  Documentary
6        Drama
7       Family
8      Foreign
9        Games

## Question 3 - Number movies in each category.

## Display how many films exist in each category.
## Table used = "film, film_category, category"

In [9]:
import pandas as pd
import mysql.connector

query_3 = """
Select c.name AS category, Count(f.film_id) AS film_count
from film f
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON c.category_id = fc.category_id
Group by c.name;
"""
df_numberMovies = pd.read_sql(query_3, conn)
df_numberMovies.to_csv("../reports/Question3_Number_Movies.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\3370681282.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_numberMovies = pd.read_sql(query_3, conn)

In [11]:
df_numberMovies.head(5)

    category  film_count
0     Action          64
1  Animation          66
2   Children          60
3   Classics          57
4     Comedy          58

## Question 4 - Show actors whose last name starts with "S".

## Lists all actors whose last names begin with the letter "S".
## Table used = "actor"

In [12]:
query_4 = """
Select first_name, last_name from actor Where last_name LIKE '%s';
"""
df_lastName = pd.read_sql(query_4, conn)
df_lastName.to_csv("../reports/Question4_lastName_actor.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\4040984064.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_lastName = pd.read_sql(query_4, conn)

In [15]:
df_lastName.head(5)

  first_name  last_name
0   PENELOPE    GUINESS
1   JENNIFER      DAVIS
2       BURT    DUKAKIS
3      JODIE  DEGENERES
4    FRANCES  DAY-LEWIS

## Question 5 - List films with their main actors.

## Displays each film with the names of its actors.
## Table used = "film, film_actor, actor"

In [17]:
query_5 = """
select f.title, a.first_name, a.last_name
from film f
JOIN film_actor fa ON f.film_id = fa.film_id
JOIN actor a ON a.actor_id = fa.actor_id;
"""
df_mainActors = pd.read_sql(query_5, conn)
df_mainActors.to_csv("../reports/Question5_mainActors.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\2025731911.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_mainActors = pd.read_sql(query_5, conn)

In [19]:
df_mainActors.head()

                   title first_name last_name
0       ACADEMY DINOSAUR   PENELOPE   GUINESS
1   ANACONDA CONFESSIONS   PENELOPE   GUINESS
2            ANGELS LIFE   PENELOPE   GUINESS
3  BULWORTH COMMANDMENTS   PENELOPE   GUINESS
4          CHEAPER CLYDE   PENELOPE   GUINESS

## Question 6 - Comedy films longer than 100 minutes.

## Show all comedy movies longer than 100 minutes.
## Table used = "film, film_category, category"

In [20]:
query_6 = """
Select f.title, f.length
from film f
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON c.category_id = fc.category_id
WHERE c.name = 'Comedy' AND length > 100;
"""
df_comedyFilms = pd.read_sql(query_6, conn)
df_comedyFilms.to_csv("../reports/Question6_Comedy_Films.csv", index = False)

C:\Users\48508\AppData\Local\Temp\ipykernel_34972\3982756131.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_comedyFilms = pd.read_sql(query_6, conn)

In [22]:
df_comedyFilms.head()

                    title  length
0     BRINGING HYSTERICAL     136
1           CAPER MOTIONS     176
2           CAT CONEHEADS     112
3  CONNECTION MICROCOSMOS     115
4          CONTROL ANTHEM     185